{"Knowledges": ["6jrGZ9WBgJihVMPMDE76hT", "FGVwWqkMn2MLoPdC6waoGd", "RcQuCZrSKbuQanDz7MGW47", "MANcDecu3XE2DBpUhRG7vy", "HGjdbUKYFonT2q2nKiuLLK", "6TYFZeBTTZbJdAYULwqKot", "ZJoDLQiTZVgaghjywMdpkC"], "ListeningQuestion": [{"content": "", "solution": "The teachers will liaise with parents to discuss the students' progress.", "rela_nodes": ["RcQuCZrSKbuQanDz7MGW47"]}, {"content": "", "solution": "There is a gathering at the community center for the holiday celebration.", "rela_nodes": ["MANcDecu3XE2DBpUhRG7vy"]}, {"content": "", "solution": "Proper aeration of lawn soil can make your grass grow greener and healthier.", "rela_nodes": ["6TYFZeBTTZbJdAYULwqKot"]}, {"content": "", "solution": "The teacher found a discrepancy in the students' attendance records and decided to double-check them.", "rela_nodes": ["HGjdbUKYFonT2q2nKiuLLK"]}, {"content": "", "solution": "Frankly, I was surprised by his unexpected decision.", "rela_nodes": ["FGVwWqkMn2MLoPdC6waoGd"]}, {"content": "", "solution": "It's futile to keep trying a password that you can't remember.", "rela_nodes": ["ZJoDLQiTZVgaghjywMdpkC"]}, {"content": "", "solution": "During the summer, the lake had a layer of green algae on the surface.", "rela_nodes": ["6jrGZ9WBgJihVMPMDE76hT"]}], "GapFillingQuestion": [{"content": "The process of brewing beer involves proper $BLANK to ensure yeast activity.", "solution": "aeration", "rela_nodes": ["6TYFZeBTTZbJdAYULwqKot"]}, {"content": "The villagers thought it was $BLANK to warn him about the incoming storm.", "solution": "futile", "rela_nodes": ["ZJoDLQiTZVgaghjywMdpkC"]}, {"content": "To be $BLANK, I was surprised by the results of the survey.", "solution": "frankly", "rela_nodes": ["FGVwWqkMn2MLoPdC6waoGd"]}, {"content": "The manager was concerned about the $BLANK in the sales figures reported by different departments.", "solution": "discrepancy", "rela_nodes": ["HGjdbUKYFonT2q2nKiuLLK"]}, {"content": "The $BLANK of friends at the park turned into a fun-filled afternoon.", "solution": "gathering", "rela_nodes": ["MANcDecu3XE2DBpUhRG7vy"]}, {"content": "Continuing to water the dead plants seemed $BLANK, as they showed no signs of life.", "solution": "futile", "rela_nodes": ["ZJoDLQiTZVgaghjywMdpkC"]}, {"content": "During the summer months, small ponds often have a $BLANK film on the surface.", "solution": "algae", "rela_nodes": ["6jrGZ9WBgJihVMPMDE76hT"]}, {"content": "He said, \"$BLANK, I didn't enjoy the movie as much as I expected.\"", "solution": "Frankly", "rela_nodes": ["FGVwWqkMn2MLoPdC6waoGd"]}, {"content": "The scientist noticed a $BLANK in the experimental results.", "solution": "discrepancy", "rela_nodes": ["HGjdbUKYFonT2q2nKiuLLK"]}, {"content": "Proper $BLANK of the pond ensures a healthy environment for the fish.", "solution": "aeration", "rela_nodes": ["6TYFZeBTTZbJdAYULwqKot"]}, {"content": "An exclusive $BLANK of artists was organized to showcase the latest creative works.", "solution": "gathering", "rela_nodes": ["MANcDecu3XE2DBpUhRG7vy"]}, {"content": "The marketing team needs to $BLANK with the sales department for the product launch.", "solution": "liaise", "rela_nodes": ["RcQuCZrSKbuQanDz7MGW47"]}, {"content": "As the team leader, your primary responsibility is to $BLANK with all departments to ensure the event runs smoothly.", "solution": "liaise", "rela_nodes": ["RcQuCZrSKbuQanDz7MGW47"]}, {"content": "The aquarium needed cleaning because it was filled with green $BLANK.", "solution": "algae", "rela_nodes": ["6jrGZ9WBgJihVMPMDE76hT"]}], "SentenceMakingQuestion": [{"content": "While on a school field trip to a nearby lake, you notice a green layer on the water's surface. Describe what you see using the word for these organisms.", "solution": "The lake had a thin layer of green algae floating on the surface, making the water look greenish.", "rela_nodes": ["6jrGZ9WBgJihVMPMDE76hT"], "analysis": ["algae"]}, {"content": "Suppose you forgot to study for an important exam and only have five minutes left before it starts. Describe your attempt to quickly learn everything in such a short time.", "solution": "It was futile to cram all the information into my head in just five minutes, as I could barely remember anything.", "rela_nodes": ["ZJoDLQiTZVgaghjywMdpkC"], "analysis": ["futile", "efforts were futile"]}, {"content": "Imagine you are organizing an event to celebrate a milestone at work, or consider a situation where you are part of a team collecting information for a project. Describe what is happening and use 'gathering' appropriately.", "solution": "The office gathering was filled with laughter and camaraderie as colleagues celebrated the successful project completion. Alternatively, the gathering of data was meticulously carried out to ensure the accuracy of our research findings.", "rela_nodes": ["MANcDecu3XE2DBpUhRG7vy"], "analysis": ["gathering", "assembly", "collecting"]}, {"content": "You're in a team meeting discussing a new project proposal, and you have some reservations about its feasibility. How would you openly express your honest opinion about it?", "solution": "Frankly, I don't believe this project is feasible with our current resources and timeline.", "rela_nodes": ["FGVwWqkMn2MLoPdC6waoGd"], "analysis": ["frankly", "openly express"]}, {"content": "You have recently started gardening and notice that your plants are not growing as well as expected. A friend suggests that you might need to improve the soil. What gardening practice involving air would you consider?", "solution": "Aeration of the soil helps improve drainage and promotes healthy root growth, so it's something I should consider doing.", "rela_nodes": ["6TYFZeBTTZbJdAYULwqKot"], "analysis": ["aeration", "soil"]}, {"content": "Imagine you are working in a company and have been asked to compare the sales figures for two different months. You notice something unusual in the numbers. How would you describe this situation?", "solution": "There was a discrepancy between the sales figures for January and February, which raised concerns about potential errors in the data.", "rela_nodes": ["HGjdbUKYFonT2q2nKiuLLK"], "analysis": ["discrepancy"]}, {"content": "You are part of a team coordinating a charity event. Describe how you would communicate with a local business to ensure their contributions are properly incorporated.", "solution": "I will liaise with the local business to confirm their donation details and ensure everything is ready for the event day.", "rela_nodes": ["RcQuCZrSKbuQanDz7MGW47"], "analysis": ["liaise", "liaise with"]}]}