{"Knowledges": ["6jrGZ9WBgJihVMPMDE76hT", "FGVwWqkMn2MLoPdC6waoGd", "RcQuCZrSKbuQanDz7MGW47", "MANcDecu3XE2DBpUhRG7vy", "HGjdbUKYFonT2q2nKiuLLK", "6TYFZeBTTZbJdAYULwqKot", "ZJoDLQiTZVgaghjywMdpkC"], "GapFillingQuestion": [{"content": "To ensure a healthy garden, proper soil $BLANK is crucial.", "solution": "aeration", "rela_nodes": ["6TYFZeBTTZbJdAYULwqKot"]}, {"content": "He told her, $BLANK speaking, that he didn't want to attend the event.", "solution": "frankly", "rela_nodes": ["FGVwWqkMn2MLoPdC6waoGd"]}, {"content": "The scientist noted a $BLANK in the experimental data that needed further investigation.", "solution": "discrepancy", "rela_nodes": ["HGjdbUKYFonT2q2nKiuLLK"]}, {"content": "Trying to fix the car without the proper tools is $BLANK.", "solution": "futile", "rela_nodes": ["ZJoDLQiTZVgaghjywMdpkC"]}, {"content": "The researchers discovered mysterious $BLANK formations along the rocky shoreline.", "solution": "algae", "rela_nodes": ["6jrGZ9WBgJihVMPMDE76hT"]}, {"content": "It is $BLANK to expect flowers to bloom in the middle of winter.", "solution": "futile", "rela_nodes": ["ZJoDLQiTZVgaghjywMdpkC"]}, {"content": "To be $BLANK, I believe we should reconsider our strategy.", "solution": "frankly", "rela_nodes": ["FGVwWqkMn2MLoPdC6waoGd"]}, {"content": "Proper $BLANK of water is essential to maintain a healthy pond ecosystem.", "solution": "aeration", "rela_nodes": ["6TYFZeBTTZbJdAYULwqKot"]}, {"content": "The neighbors organized a $BLANK to celebrate the new year together.", "solution": "gathering", "rela_nodes": ["MANcDecu3XE2DBpUhRG7vy"]}, {"content": "The final audit revealed a $BLANK, showing that some figures were inaccurately recorded.", "solution": "discrepancy", "rela_nodes": ["HGjdbUKYFonT2q2nKiuLLK"]}, {"content": "The annual neighborhood $BLANK was held in the park, with food and games for everyone.", "solution": "gathering", "rela_nodes": ["MANcDecu3XE2DBpUhRG7vy"]}, {"content": "The school plans to $BLANK with parents to discuss the new curriculum changes.", "solution": "liaise", "rela_nodes": ["RcQuCZrSKbuQanDz7MGW47"]}, {"content": "The school plans to $BLANK with parents to address their concerns about the new policy.", "solution": "liaise", "rela_nodes": ["RcQuCZrSKbuQanDz7MGW47"]}, {"content": "After weeks of neglect, the aquarium glass became clouded with $BLANK.", "solution": "algae", "rela_nodes": ["6jrGZ9WBgJihVMPMDE76hT"]}], "ListeningQuestion": [{"content": "", "solution": "The teacher noticed a discrepancy in the students' test scores and their homework performance.", "rela_nodes": ["HGjdbUKYFonT2q2nKiuLLK"]}, {"content": "", "solution": "Our team needs to liaise with the marketing department to align our campaign strategies.", "rela_nodes": ["RcQuCZrSKbuQanDz7MGW47"]}, {"content": "", "solution": "Trying to fix the broken vase without glue was futile.", "rela_nodes": ["ZJoDLQiTZVgaghjywMdpkC"]}, {"content": "", "solution": "Frankly, I was surprised by how quickly he finished the project.", "rela_nodes": ["FGVwWqkMn2MLoPdC6waoGd"]}, {"content": "", "solution": "Regular aeration of your lawn can prevent water from pooling on the surface and helps the grass grow better.", "rela_nodes": ["6TYFZeBTTZbJdAYULwqKot"]}, {"content": "", "solution": "When snorkeling in the ocean, you can see colorful fish swimming near the algae.", "rela_nodes": ["6jrGZ9WBgJihVMPMDE76hT"]}, {"content": "", "solution": "They hosted a gathering of friends to celebrate her birthday.", "rela_nodes": ["MANcDecu3XE2DBpUhRG7vy"]}], "SentenceMakingQuestion": [{"content": "Think about a time when someone tried repeatedly to teach a stubborn dog a new trick, but the dog just wouldn't learn. Describe the outcome of their attempts.", "solution": "Their attempts to teach the stubborn dog to sit were futile, as the dog simply ignored every command.", "rela_nodes": ["ZJoDLQiTZVgaghjywMdpkC"], "analysis": ["futile", "attempts were futile"]}, {"content": "Imagine you are visiting a calm, freshwater lake during a vacation. As you look at the water, you notice something green floating on the surface. Describe what you see.", "solution": "The surface of the lake was dotted with clusters of green algae, gently drifting with the water's movements.", "rela_nodes": ["6jrGZ9WBgJihVMPMDE76hT"], "analysis": ["algae", "green algae"]}, {"content": "Imagine you are reviewing the monthly financial statements of your company, and you notice something doesn't add up. Describe the situation where this issue is discovered.", "solution": "While reviewing the monthly financial statements, I found a discrepancy between the recorded sales figures and the actual income received.", "rela_nodes": ["HGjdbUKYFonT2q2nKiuLLK"], "analysis": ["discrepancy", "between"]}, {"content": "You are part of a committee responsible for planning a charity event. Describe how you would ensure that different groups involved work together smoothly.", "solution": "I will liaise with the various teams to ensure all aspects of the event, from marketing to logistics, are well-coordinated and nothing is overlooked.", "rela_nodes": ["RcQuCZrSKbuQanDz7MGW47"], "analysis": ["liaise", "liaise with"]}, {"content": "You are planning a special event for your family where everyone can come together and enjoy each other's company. Describe this event and how it will bring everyone closer.", "solution": "The family gathering was planned at the park, with games, food, and laughter, making it a memorable day for everyone.", "rela_nodes": ["MANcDecu3XE2DBpUhRG7vy"], "analysis": ["gathering", "family gathering"]}, {"content": "You have been asked by a friend for your honest opinion about a presentation they are preparing for work. How would you express your view?", "solution": "Frankly, I think you need to work on the clarity of your main points to make the presentation more effective.", "rela_nodes": ["FGVwWqkMn2MLoPdC6waoGd"], "analysis": ["frankly", "in an open, honest, and direct manner"]}, {"content": "You are helping your neighbor with their garden, and you notice the soil seems compacted. Explain the benefit of using a garden fork to create small holes in the soil.", "solution": "Aeration of the soil helps improve drainage and promotes healthy root growth, allowing plants to thrive better.", "rela_nodes": ["6TYFZeBTTZbJdAYULwqKot"], "analysis": ["aeration", "process of introducing air"]}]}