{"Knowledges": ["6jrGZ9WBgJihVMPMDE76hT", "FGVwWqkMn2MLoPdC6waoGd", "RcQuCZrSKbuQanDz7MGW47", "MANcDecu3XE2DBpUhRG7vy", "HGjdbUKYFonT2q2nKiuLLK", "6TYFZeBTTZbJdAYULwqKot", "ZJoDLQiTZVgaghjywMdpkC"], "ListeningQuestion": [{"content": "", "solution": "Trying to fix the broken clock without the right tools was futile.", "rela_nodes": ["ZJoDLQiTZVgaghjywMdpkC"]}, {"content": "", "solution": "The teacher will liaise with parents about the upcoming school trip.", "rela_nodes": ["RcQuCZrSKbuQanDz7MGW47"]}, {"content": "", "solution": "We noticed algae floating on the surface of the lake during our walk.", "rela_nodes": ["6jrGZ9WBgJihVMPMDE76hT"]}, {"content": "", "solution": "They organized a gathering to celebrate the holiday with friends and family.", "rela_nodes": ["MANcDecu3XE2DBpUhRG7vy"]}, {"content": "", "solution": "Frankly, I was surprised by how quickly he finished the project.", "rela_nodes": ["FGVwWqkMn2MLoPdC6waoGd"]}, {"content": "", "solution": "Aeration is needed in gardens to ensure the plants receive enough air for better growth.", "rela_nodes": ["6TYFZeBTTZbJdAYULwqKot"]}, {"content": "", "solution": "The scientist noticed a discrepancy in the experiment results that needed further investigation.", "rela_nodes": ["HGjdbUKYFonT2q2nKiuLLK"]}], "GapFillingQuestion": [{"content": "Regular $BLANK of the lawn ensures that the grass grows lush and green.", "solution": "aeration", "rela_nodes": ["6TYFZeBTTZbJdAYULwqKot"]}, {"content": "The swimming pool water appeared green due to the growth of $BLANK.", "solution": "algae", "rela_nodes": ["6jrGZ9WBgJihVMPMDE76hT"]}, {"content": "The teacher will $BLANK with the parents to discuss the student's progress.", "solution": "liaise", "rela_nodes": ["RcQuCZrSKbuQanDz7MGW47"]}, {"content": "$BLANK, I have never seen such an impressive performance.", "solution": "Frankly", "rela_nodes": ["FGVwWqkMn2MLoPdC6waoGd"]}, {"content": "The $BLANK was held in honor of the newlyweds at a beautiful beachside venue.", "solution": "gathering", "rela_nodes": ["MANcDecu3XE2DBpUhRG7vy"]}, {"content": "He spoke $BLANK about the show, mentioning both the highlights and the flaws.", "solution": "frankly", "rela_nodes": ["FGVwWqkMn2MLoPdC6waoGd"]}, {"content": "The gardener used a tool to improve $BLANK in the soil, ensuring the plants received enough air and nutrients.", "solution": "aeration", "rela_nodes": ["6TYFZeBTTZbJdAYULwqKot"]}, {"content": "Swimming in the lake was not enjoyable because it was filled with thick, green $BLANK.", "solution": "algae", "rela_nodes": ["6jrGZ9WBgJihVMPMDE76hT"]}, {"content": "It's crucial for the marketing team to $BLANK with the sales department to achieve our goals.", "solution": "liaise", "rela_nodes": ["RcQuCZrSKbuQanDz7MGW47"]}, {"content": "It seemed $BLANK to attempt to finish the puzzle with missing pieces.", "solution": "futile", "rela_nodes": ["ZJoDLQiTZVgaghjywMdpkC"]}, {"content": "We had to resolve the $BLANK in the contract details before finalizing the deal.", "solution": "discrepancy", "rela_nodes": ["HGjdbUKYFonT2q2nKiuLLK"]}, {"content": "The scientist noticed a $BLANK between the results of both experiments.", "solution": "discrepancy", "rela_nodes": ["HGjdbUKYFonT2q2nKiuLLK"]}, {"content": "After hours of negotiation, it was clear that attempting to bring the sides together was utterly $BLANK.", "solution": "futile", "rela_nodes": ["ZJoDLQiTZVgaghjywMdpkC"]}, {"content": "There was a large $BLANK to discuss the upcoming events in the community.", "solution": "gathering", "rela_nodes": ["MANcDecu3XE2DBpUhRG7vy"]}], "SentenceMakingQuestion": [{"content": "Imagine you are working on a large team project that requires coordination with different departments to ensure everything goes smoothly. How would you describe your efforts to keep everyone informed and organized?", "solution": "I will liaise with the marketing and sales teams to ensure everyone is on track and aware of the project deadlines.", "rela_nodes": ["RcQuCZrSKbuQanDz7MGW47"], "analysis": ["liaise", "will liaise"]}, {"content": "You are having a conversation with a friend who is asking for your opinion about a challenge they are facing. They have approached you because they value your honest perspective.", "solution": "Frankly, I think you should consider telling your boss about how overwhelmed you feel before it affects your work.", "rela_nodes": ["FGVwWqkMn2MLoPdC6waoGd"], "analysis": ["frankly", "adverbs of manner"]}, {"content": "Suppose you have been trying to convince a friend to change their opinion on an important topic, but they refuse to consider your points. Describe the situation using the appropriate word.", "solution": "It is futile to continue trying to persuade them because they are completely unwilling to listen to any arguments.", "rela_nodes": ["ZJoDLQiTZVgaghjywMdpkC"], "analysis": ["futile"]}, {"content": "You're reviewing two sets of monthly sales reports for your company, but you notice something odd. What do you observe?", "solution": "There is a discrepancy between the two reports that needs further investigation to ensure all figures are correct.", "rela_nodes": ["HGjdbUKYFonT2q2nKiuLLK"], "analysis": ["discrepancy", "lack of compatibility", "similarity between two or more facts"]}, {"content": "You're planning a reunion with your high school friends. Describe what you have planned for this event.", "solution": "We are organizing a gathering at the park where we can catch up, play games, and enjoy a picnic together.", "rela_nodes": ["MANcDecu3XE2DBpUhRG7vy"], "analysis": ["gathering", "social meeting"]}, {"content": "You are taking care of an aquarium at home, and you notice something growing on the glass and decorations. Describe what you see and how it affects the aquarium.", "solution": "I noticed that algae had started to grow on the glass and decorations in the aquarium, turning everything a shade of green and making it look murky.", "rela_nodes": ["6jrGZ9WBgJihVMPMDE76hT"], "analysis": ["algae", "noun"]}, {"content": "You are tasked with maintaining a small vegetable garden. Explain why it's important to periodically aerate the soil and what this process accomplishes.", "solution": "Aeration of the soil helps improve drainage and promotes healthy root growth, ensuring that the plants get enough nutrients and water.", "rela_nodes": ["6TYFZeBTTZbJdAYULwqKot"], "analysis": ["aeration", "aerate"]}]}