{"Knowledges": ["6jrGZ9WBgJihVMPMDE76hT", "FGVwWqkMn2MLoPdC6waoGd", "RcQuCZrSKbuQanDz7MGW47", "MANcDecu3XE2DBpUhRG7vy", "HGjdbUKYFonT2q2nKiuLLK", "6TYFZeBTTZbJdAYULwqKot", "ZJoDLQiTZVgaghjywMdpkC"], "ListeningQuestion": [{"content": "", "solution": "We had a joyful gathering with friends to celebrate the holiday.", "rela_nodes": ["MANcDecu3XE2DBpUhRG7vy"]}, {"content": "", "solution": "There was a discrepancy between the amount on the receipt and the amount charged to my card.", "rela_nodes": ["HGjdbUKYFonT2q2nKiuLLK"]}, {"content": "", "solution": "Aeration is important for keeping the grass healthy by allowing air, water, and nutrients to reach the roots.", "rela_nodes": ["6TYFZeBTTZbJdAYULwqKot"]}, {"content": "", "solution": "Trying to water the garden during the heavy rain was a futile task.", "rela_nodes": ["ZJoDLQiTZVgaghjywMdpkC"]}, {"content": "", "solution": "The teacher will liaise with parents to discuss the students' progress.", "rela_nodes": ["RcQuCZrSKbuQanDz7MGW47"]}, {"content": "", "solution": "Frankly, I was surprised by how well you handled the situation.", "rela_nodes": ["FGVwWqkMn2MLoPdC6waoGd"]}, {"content": "", "solution": "The aquarium needed cleaning because algae were growing on the glass.", "rela_nodes": ["6jrGZ9WBgJihVMPMDE76hT"]}], "GapFillingQuestion": [{"content": "The researchers observed that the $BLANK in the aquarium grew rapidly under the artificial light.", "solution": "algae", "rela_nodes": ["6jrGZ9WBgJihVMPMDE76hT"]}, {"content": "As part of their duties, the marketing team needs to $BLANK with the sales department for the upcoming launch.", "solution": "liaise", "rela_nodes": ["RcQuCZrSKbuQanDz7MGW47"]}, {"content": "$BLANK, I'm amazed by how quickly you finished the project.", "solution": "Frankly", "rela_nodes": ["FGVwWqkMn2MLoPdC6waoGd"]}, {"content": "The pond's water quality improved significantly after proper $BLANK practices were implemented.", "solution": "aeration", "rela_nodes": ["6TYFZeBTTZbJdAYULwqKot"]}, {"content": "$BLANK, I have never tasted a cake as delicious as this one.", "solution": "Frankly", "rela_nodes": ["FGVwWqkMn2MLoPdC6waoGd"]}, {"content": "The researcher noticed a $BLANK between the survey results and the initial hypothesis.", "solution": "discrepancy", "rela_nodes": ["HGjdbUKYFonT2q2nKiuLLK"]}, {"content": "The $BLANK between the two schedules caused confusion among the team members.", "solution": "discrepancy", "rela_nodes": ["HGjdbUKYFonT2q2nKiuLLK"]}, {"content": "The $BLANK of community members at the park was organized to address neighborhood issues.", "solution": "gathering", "rela_nodes": ["MANcDecu3XE2DBpUhRG7vy"]}, {"content": "Gardeners often enhance plant growth by ensuring adequate $BLANK of the soil.", "solution": "aeration", "rela_nodes": ["6TYFZeBTTZbJdAYULwqKot"]}, {"content": "The project lead will need to $BLANK with the design team to finalize the layout plans.", "solution": "liaise", "rela_nodes": ["RcQuCZrSKbuQanDz7MGW47"]}, {"content": "After the storm, the beach was littered with clumps of $BLANK along the shoreline.", "solution": "algae", "rela_nodes": ["6jrGZ9WBgJihVMPMDE76hT"]}, {"content": "Despite hours of work, all attempts to repair the old printer proved $BLANK.", "solution": "futile", "rela_nodes": ["ZJoDLQiTZVgaghjywMdpkC"]}, {"content": "The community planned a $BLANK to celebrate the annual festival.", "solution": "gathering", "rela_nodes": ["MANcDecu3XE2DBpUhRG7vy"]}, {"content": "It seems $BLANK to continue planting seeds in this barren soil.", "solution": "futile", "rela_nodes": ["ZJoDLQiTZVgaghjywMdpkC"]}], "SentenceMakingQuestion": [{"content": "Imagine you are visiting a freshwater lake during the summer. Describe the appearance of the water's surface.", "solution": "The surface of the lake was dotted with patches of green algae, giving the water a vibrant, though slightly murky, appearance.", "rela_nodes": ["6jrGZ9WBgJihVMPMDE76hT"], "analysis": ["algae", "green algae"]}, {"content": "Imagine you have been invited to a special event where many family members and friends will come together to celebrate a significant occasion. Describe this event.", "solution": "The birthday gathering at the park was filled with laughter, games, and delicious food as friends and family came together to celebrate the occasion.", "rela_nodes": ["MANcDecu3XE2DBpUhRG7vy"], "analysis": ["gathering", "family gathering"]}, {"content": "Imagine you are working as a team leader reviewing your team's monthly reports. You notice something doesn't match up between the numbers in two different reports. Describe what you found.", "solution": "There was a discrepancy between the sales report and the inventory records, indicating that either some sales were not properly recorded or inventory was miscounted.", "rela_nodes": ["HGjdbUKYFonT2q2nKiuLLK"], "analysis": ["discrepancy", "a discrepancy between"]}, {"content": "Imagine you are in a discussion with a friend who has suggested a plan you have reservations about. How would you express your honest opinion on the idea?", "solution": "Frankly, I don't think it's a good idea because it seems too risky and expensive.", "rela_nodes": ["FGVwWqkMn2MLoPdC6waoGd"], "analysis": ["frankly", "express opinion"]}, {"content": "Imagine you're trying to log into an online platform for a meeting, but the website keeps crashing. How would you describe your attempts to access the meeting?", "solution": "My attempts to log into the meeting were futile because the website remained down despite multiple tries.", "rela_nodes": ["ZJoDLQiTZVgaghjywMdpkC"], "analysis": ["futile"]}, {"content": "You are helping your friend with their garden. They are curious about why you are poking holes in the soil and turning it over. Explain the purpose of this action.", "solution": "I am aerating the soil to improve drainage and ensure that the roots of the plants grow healthily.", "rela_nodes": ["6TYFZeBTTZbJdAYULwqKot"], "analysis": ["aeration", "aerate"]}, {"content": "You're organizing a school event and need to ensure that everything is running smoothly. Describe how you will communicate and coordinate with the vendors involved.", "solution": "I will liaise with each vendor to confirm their arrival times and ensure they have everything they need for the event.", "rela_nodes": ["RcQuCZrSKbuQanDz7MGW47"], "analysis": ["liaise", "communicate and coordinate"]}]}